frontend/controllers/EventosController.php

SELECT * FROM `eventos` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Eventos::findOne($id)) !== null) {