frontend/controllers/UploadController.php

    public function actionUpload()
    {

        $model = new UploadForm();
        $eventosModel = new Eventos();
//////////////////////////////////////////////
        if (Yii::$app->request->isPost) {

            $base_url =  Url::home(true);
            $id       =  Yii::$app->request->post('id');
            $numero   =  Yii::$app->request->post('numero');
            $tipo     =  Yii::$app->request->post('tipo');

            $model->file = UploadedFile::getInstances($model,'file');

            if ($model->file && $model->validate()) {

                foreach($model->file as $file)
                {
                    $file->saveAs('uploads/' . $file->baseName . '.' . $file->extension);
                    $url = $base_url . 'uploads/' . $file->baseName . '.' . $file->extension;
                    $eventosModel->id = $id;

                    $eventosModel = Eventos::findOne($id);
---
SELECT * FROM `eventos` WHERE `id`='11'

                        $eventosModel->urlVideoMovil = $url;
                    }
                }
                $eventosModel->update();
---
UPDATE `eventos` SET `urlFoto2`='http://pixweb.local/uploads/yii2advanced.sql' WHERE `id`=11